app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1
---
    public function doLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (!$username || !$password) {
            return redirect()->back()->with('error', 'Username dan password wajib diisi.');
        }

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();