app/Controllers/BookingController.php

    public function index()
    {
        $status   = $this->request->getGet('status') ?? '';
        $search   = $this->request->getGet('search') ?? '';

        $builder = $this->db->table('bookings b')
            ->select('b.*, r.nama_ruangan, r.kode_ruangan, r.lokasi')
            ->join('rooms r', 'r.id = b.room_id')
            ->orderBy('b.created_at', 'DESC');

        // User (pembooking) hanya melihat booking miliknya sendiri.
        // Admin melihat semua booking.
        if (!$this->isAdmin()) {
            $builder->where('b.user_id', session()->get('user_id'));
        }

        if ($status) {
            $builder->where('b.status', $status);
        }
        if ($search) {
            $builder->groupStart()
                ->like('b.nama_peminjam', $search)
                ->orLike('r.nama_ruangan', $search)
                ->orLike('b.keperluan', $search)
            ->groupEnd();
        }

        $bookings = $builder->get()->getResultArray();
---
SELECT `b`.*, `r`.`nama_ruangan`, `r`.`kode_ruangan`, `r`.`lokasi`
FROM `bookings` `b`
JOIN `rooms` `r` ON `r`.`id` = `b`.`room_id`
WHERE `b`.`user_id` = '3'
AND `b`.`status` = 'pending'
ORDER BY `b`.`created_at` DESC

            ]);
        }

        $this->bookingModel->update($id, $data);
---
UPDATE `bookings` SET `status` = 'approved', `updated_at` = '2026-08-07 08:43:37'
WHERE `bookings`.`id` IN (21)

    public function approve(int $id)
    {
        $booking = $this->bookingModel->find($id);
---
SELECT *
FROM `bookings`
WHERE `bookings`.`id` = 21