app/Controllers/Dashboard.php

SELECT *
FROM `rooms`
---
    public function index()
    {
        $roomModel    = new RoomModel();
        $bookingModel = new BookingModel();

        $isAdmin      = is_admin_role();
        // User (pembooking) hanya melihat statistik & jadwal booking miliknya sendiri.
        $filterUserId = $isAdmin ? null : (int) session()->get('user_id');

        $rooms        = $roomModel->findAll();