app/Controllers/ProfileController.php

    public function edit()
    {
        $user = $this->userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'