app/Controllers/ReportController.php

SELECT `b`.*, `r`.`nama_ruangan`, `r`.`kode_ruangan`, `r`.`lokasi`
FROM `bookings` `b`
JOIN `rooms` `r` ON `r`.`id` = `b`.`room_id`
ORDER BY `b`.`tanggal_mulai` DESC, `b`.`jam_mulai` DESC
---
    protected function getFilteredBookings(): array
    {
        $tanggalDari = $this->request->getGet('tanggal_dari') ?? '';
        $tanggalSampai = $this->request->getGet('tanggal_sampai') ?? '';
        $roomId      = $this->request->getGet('room_id') ?? '';
        $status      = $this->request->getGet('status') ?? '';

        $builder = $this->db->table('bookings b')
            ->select('b.*, r.nama_ruangan, r.kode_ruangan, r.lokasi')
            ->join('rooms r', 'r.id = b.room_id')
            ->orderBy('b.tanggal_mulai', 'DESC')
            ->orderBy('b.jam_mulai', 'DESC');

        if ($tanggalDari) {
            $builder->where('b.tanggal_mulai >=', $tanggalDari);
        }
        if ($tanggalSampai) {
            $builder->where('b.tanggal_mulai <=', $tanggalSampai);
        }
        if ($roomId) {
            $builder->where('b.room_id', $roomId);
        }
        if ($status) {
            $builder->where('b.status', $status);
        }

        return $builder->get()->getResultArray();

SELECT *
FROM `rooms`
ORDER BY `nama_ruangan` ASC
---
    public function bookings()
    {
        $bookings = $this->getFilteredBookings();
        $filters  = $this->getFilters();
        $rooms    = $this->roomModel->orderBy('nama_ruangan', 'ASC')->findAll();