app/Controllers/RoomController.php

SELECT *
FROM `rooms`
WHERE `rooms`.`id` = 4
---
    public function edit(int $id)
    {
        $room = $this->roomModel->find($id);

SELECT *
FROM `bookings`
WHERE `room_id` = 7
ORDER BY `tanggal_mulai` DESC, `jam_mulai` DESC
---
    public function show(int $id)
    {
        $room = $this->roomModel->find($id);
        if (!$room) {
            return redirect()->to(base_url('rooms'))->with('error', 'Ruangan tidak ditemukan.');
        }

        $bookings = $this->db->table('bookings')
            ->where('room_id', $id)
            ->orderBy('tanggal_mulai', 'DESC')
            ->orderBy('jam_mulai', 'DESC')
            ->get()
            ->getResultArray();