app/Controllers/RoomController.php

SELECT *
FROM `rooms`
WHERE `rooms`.`id` = 1
---
    public function edit(int $id)
    {
        $room = $this->roomModel->find($id);

SELECT *
FROM `rooms`
WHERE `rooms`.`id` = 7
---
    public function update(int $id)
    {
        $room = $this->roomModel->find($id);

UPDATE `rooms` SET `kode_ruangan` = 'R-001', `nama_ruangan` = 'Diklat Lokal A', `kapasitas` = '30', `lokasi` = 'Gedung Diklat', `fasilitas` = 'Proyektor, AC, Whiteboard, Sound System, WiFi', `deskripsi` = 'Ruang rapat utama dengan kapasitas besar, cocok untuk rapat besar dan presentasi.', `status` = 'available', `foto` = '1783238916_d9a64559d5b310c23efe.png', `updated_at` = '2026-08-13 10:58:10'
WHERE `rooms`.`id` IN (1)
---
            $foto = null;
        }

        $this->roomModel->update($id, [
            'kode_ruangan' => $this->request->getPost('kode_ruangan'),
            'nama_ruangan' => $this->request->getPost('nama_ruangan'),
            'kapasitas'    => $this->request->getPost('kapasitas'),
            'lokasi'       => $this->request->getPost('lokasi'),
            'fasilitas'    => $this->request->getPost('fasilitas'),
            'deskripsi'    => $this->request->getPost('deskripsi'),
            'status'       => $this->request->getPost('status'),
            'foto'         => $foto,
        ]);

INSERT INTO `room_photos` (`room_id`, `filename`, `urutan`, `created_at`) VALUES (1, '1786593490_11658c6fc176bb21996c.png', 0, '2026-08-13 10:58:10')
---
        if (isset($gallery['filenames'])) {
            $toInsert = array_slice($gallery['filenames'], 0, $remainingSlots);
            foreach ($toInsert as $i => $fn) {
                $this->roomPhotoModel->insert(['room_id' => $id, 'filename' => $fn, 'urutan' => $existingCount + $i]);

SELECT *
FROM `rooms`
WHERE `rooms`.`id` = 1
---
    public function deletePhoto(int $photoId)
    {
        $photo = $this->roomPhotoModel->find($photoId);

SELECT *
FROM `bookings`
WHERE `room_id` = 1
ORDER BY `tanggal_mulai` DESC, `jam_mulai` DESC
---
    public function show(int $id)
    {
        $room = $this->roomModel->find($id);
        if (!$room) {
            return redirect()->to(base_url('rooms'))->with('error', 'Ruangan tidak ditemukan.');
        }

        $bookings = $this->db->table('bookings')
            ->where('room_id', $id)
            ->orderBy('tanggal_mulai', 'DESC')
            ->orderBy('jam_mulai', 'DESC')
            ->get()
            ->getResultArray();