app/Controllers/ScheduleController.php

SELECT *
FROM `rooms`
ORDER BY `nama_ruangan` ASC
SELECT `b`.*, `r`.`nama_ruangan`, `r`.`kode_ruangan`
FROM `bookings` `b`
JOIN `rooms` `r` ON `r`.`id` = `b`.`room_id`
WHERE `b`.`room_id` IN (5,1,2,3,4,8,7,6)
AND `b`.`status` IN ('pending','approved','selesai')
AND `b`.`tanggal_mulai` <= '2026-08-16'
AND `b`.`tanggal_selesai` >= '2026-08-10'
ORDER BY `b`.`jam_mulai` ASC
---
    public function index()
    {
        $view = $this->request->getGet('view') ?? 'mingguan';
        if (!in_array($view, ['harian', 'mingguan', 'bulanan'], true)) {
            $view = 'mingguan';
        }

        $dateParam = $this->request->getGet('date');
        $date = ($dateParam && strtotime($dateParam)) ? $dateParam : date('Y-m-d');

        $allRooms   = $this->roomModel->orderBy('nama_ruangan', 'ASC')->findAll();
        $roomIdsGet = $this->request->getGet('rooms');
        $filterSubmitted = $this->request->getGet('filter_submitted');
        if (is_array($roomIdsGet) && count($roomIdsGet) > 0) {
            $selectedRoomIds = array_map('intval', $roomIdsGet);
        } elseif ($filterSubmitted) {
            // Form filter disubmit tapi tidak ada ruangan dicentang — hormati pilihan kosong tsb.
            $selectedRoomIds = [];
        } else {
            // Kunjungan pertama tanpa query string — tampilkan semua ruangan secara default.
            $selectedRoomIds = array_map(fn ($r) => (int) $r['id'], $allRooms);
        }
        $selectedRooms = array_values(array_filter($allRooms, fn ($r) => in_array((int) $r['id'], $selectedRoomIds, true)));

        // Tentukan rentang tanggal yang ditampilkan sesuai jenis tampilan
        [$rangeStart, $rangeEnd, $days] = $this->computeRange($view, $date);

        $bookings = [];
        if (!empty($selectedRoomIds)) {
            $bookings = $this->db->table('bookings b')
                ->select('b.*, r.nama_ruangan, r.kode_ruangan')
                ->join('rooms r', 'r.id = b.room_id')
                ->whereIn('b.room_id', $selectedRoomIds)
                ->whereIn('b.status', ['pending', 'approved', 'selesai'])
                ->where('b.tanggal_mulai <=', $rangeEnd)
                ->where('b.tanggal_selesai >=', $rangeStart)
                ->orderBy('b.jam_mulai', 'ASC')
                ->get()
                ->getResultArray();