app/Controllers/UserController.php

SELECT *
FROM `users`
ORDER BY `id` ASC
---
    public function index()
    {
        $users = $this->userModel->orderBy('id', 'ASC')->findAll();