app/Models/BookingModel.php

    public function expireOverduePending(): int
    {
        $today = date('Y-m-d');

        $overdue = $this->where('status', 'pending')
            ->where('tanggal_mulai <', $today)
            ->findAll();
---
SELECT *
FROM `bookings`
WHERE `status` = 'pending'
AND `tanggal_mulai` < '2026-08-13'

    public function getStats(?int $userId = null): array
    {
        $today = date('Y-m-d');

        $totalQ = $this->db->table('bookings');
        $pendingQ = $this->db->table('bookings')->where('status', 'pending');
        $approvedQ = $this->db->table('bookings')->where('status', 'approved');
        $todayQ = $this->db->table('bookings')
            ->where('tanggal_mulai <=', $today)
            ->where('tanggal_selesai >=', $today)
            ->whereIn('status', ['pending', 'approved']);

        if ($userId) {
            $totalQ->where('user_id', $userId);
            $pendingQ->where('user_id', $userId);
            $approvedQ->where('user_id', $userId);
            $todayQ->where('user_id', $userId);
        }

        return [
            'total'    => $totalQ->countAllResults(),
            'pending'  => $pendingQ->countAllResults(),
            'approved' => $approvedQ->countAllResults(),
            'today'    => $todayQ->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `bookings`
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `tanggal_mulai` <= '2026-08-13'
AND `tanggal_selesai` >= '2026-08-13'
AND `status` IN ('pending','approved')