app/Models/BookingModel.php

    public function getTodayBookings(?int $userId = null): array
    {
        $today = date('Y-m-d');
        $builder = $this->db->table('bookings b')
            ->select('b.*, r.nama_ruangan, r.kode_ruangan, r.lokasi')
            ->join('rooms r', 'r.id = b.room_id')
            ->where('b.tanggal_mulai <=', $today)
            ->where('b.tanggal_selesai >=', $today)
            ->whereIn('b.status', ['pending', 'approved'])
            ->orderBy('b.jam_mulai', 'ASC');

        if ($userId) {
            $builder->where('b.user_id', $userId);
        }

        return $builder->get()->getResultArray();
---
SELECT `b`.*, `r`.`nama_ruangan`, `r`.`kode_ruangan`, `r`.`lokasi`
FROM `bookings` `b`
JOIN `rooms` `r` ON `r`.`id` = `b`.`room_id`
WHERE `b`.`tanggal_mulai` <= '2026-07-22'
AND `b`.`tanggal_selesai` >= '2026-07-22'
AND `b`.`status` IN ('pending','approved')
AND `b`.`user_id` = 3
ORDER BY `b`.`jam_mulai` ASC

    public function getBookingById(int $id): ?array
    {
        return $this->db->table('bookings b')
            ->select('b.*, r.nama_ruangan, r.kode_ruangan, r.lokasi, r.kapasitas, r.fasilitas')
            ->join('rooms r', 'r.id = b.room_id')
            ->where('b.id', $id)
            ->get()
            ->getRowArray() ?: null;
---
SELECT `b`.*, `r`.`nama_ruangan`, `r`.`kode_ruangan`, `r`.`lokasi`, `r`.`kapasitas`, `r`.`fasilitas`
FROM `bookings` `b`
JOIN `rooms` `r` ON `r`.`id` = `b`.`room_id`
WHERE `b`.`id` = 21

    public function getStats(?int $userId = null): array
    {
        $today = date('Y-m-d');

        $totalQ = $this->db->table('bookings');
        $pendingQ = $this->db->table('bookings')->where('status', 'pending');
        $approvedQ = $this->db->table('bookings')->where('status', 'approved');
        $todayQ = $this->db->table('bookings')
            ->where('tanggal_mulai <=', $today)
            ->where('tanggal_selesai >=', $today)
            ->whereIn('status', ['pending', 'approved']);

        if ($userId) {
            $totalQ->where('user_id', $userId);
            $pendingQ->where('user_id', $userId);
            $approvedQ->where('user_id', $userId);
            $todayQ->where('user_id', $userId);
        }

        return [
            'total'    => $totalQ->countAllResults(),
            'pending'  => $pendingQ->countAllResults(),
            'approved' => $approvedQ->countAllResults(),
            'today'    => $todayQ->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
AND `user_id` = 3
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `tanggal_mulai` <= '2026-07-21'
AND `tanggal_selesai` >= '2026-07-21'
AND `status` IN ('pending','approved')
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `tanggal_mulai` <= '2026-07-22'
AND `tanggal_selesai` >= '2026-07-22'
AND `status` IN ('pending','approved')
AND `user_id` = 3