app/Models/RoomModel.php

    public function getRoomsWithBookingStatus(string $date = null): array
    {
        $date = $date ?? date('Y-m-d');
        $now  = date('H:i:s');

        $rooms = $this->findAll();

        foreach ($rooms as &$room) {
            if ($room['status'] === 'maintenance') {
                $room['booking_status'] = 'maintenance';
            } else {
                $booking = $this->db->table('bookings')
                    ->where('room_id', $room['id'])
                    ->where('tanggal_mulai <=', $date)
                    ->where('tanggal_selesai >=', $date)
                    ->where('jam_mulai <=', $now)
                    ->where('jam_selesai >', $now)
                    ->whereIn('status', ['approved'])
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `rooms`
SELECT *
FROM `bookings`
WHERE `room_id` = '1'
AND `tanggal_mulai` <= '2026-08-13'
AND `tanggal_selesai` >= '2026-08-13'
AND `jam_mulai` <= '10:53:59'
AND `jam_selesai` > '10:53:59'
AND `status` IN ('approved')