app/Models/RoomPhotoModel.php

SELECT *
FROM `room_photos`
WHERE `room_id` = 1
ORDER BY `urutan` ASC, `id` ASC
---
    public function getForRoom(int $roomId): array
    {
        return $this->where('room_id', $roomId)->orderBy('urutan', 'ASC')->orderBy('id', 'ASC')->findAll();